tutorials/reactingQGDFoam/2D/backwardFacingStep/constant/reactions
species
(
    O2
    N2
);

reactions
{
}
