tutorials/reactingQGDFoam/2D/backwardFacingStep/constant/thermo.compressibleGas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


O2
{
    specie
    {
        nMoles          2;
        molWeight       31.999;
    }
    thermodynamics
    {
        Cp    918;
        Cv    658;
        Hf    0;
    }
    transport
    {
        mu    0.204;//2.052e-05;
        Pr    0.7;
    }
}

N2
{
    specie
    {
        nMoles          2;
        molWeight       28.013;
    }
    thermodynamics
    {
        Cp     1039;
        Cv     743;
        Hf     0;
    }
    transport
    {
        mu    0.204;  //1.778e-05;
        Pr    0.7;
    }
}

// ************************************************************************* //
