tutorials/reactingQGDFoam/2D/backwardFacingStep/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch backwardFacingStep.foam
runApplication blockMesh
runApplication `getApplication`

#------------------------------------------------------------------------------
